--[[
|------------------------------------------------- |--------- ______-----------------_______---|
|   ______   __   ______    _____     _____    __  |  _____  |  ____|  __     __    /  _____/  |
|  |__  __| |  | |__  __|  /     \   |     \  |  | | |__   | | |____  |  |   |  |  /  /____    |
|    |  |   |  |   |  |   /  /_\  \  |  |\  \ |  | |   /  /  |  ____| |  |   |  |  \____   /   |
|    |  |   |  |   |  |  /  _____  \ |  | \  \|  | |  /  /_  | |____  |  |___|  |   ___/  /    |
|    |__|   |__|   |__| /__/     \__\|__|  \_____| | |_____| |______|  \_______/  /______/     |
|--------------------------------------------------|-------------------------------------------|
| This Project Powered by : Pouya Poorrahman CopyRight 2016 Jove Version 4.0 Anti Spam Cli Bot |
|----------------------------------------------------------------------------------------------|
]]
do

function run(msg, matches)
  return [[ 
🔰ورژن:Tele_sped V4.0🔰
🔰یه ربات برنامه ریزی شده برپایه سید (هوشمند،سریع،قدرتمند)🔰
🔰مدل پردازنده:Intel(R) Core(TM) i7-6700 CPU @ 3.40GHz🔰
🔰تعداد هسته:2-1-1-2هسته🔰
🔰مقدار رم:2-1-1-2گیگ🔰
🔰هارد:60-40-40-60گیگ اس اس دی🔰
🔰محل سرور:هلند-آمریکا-آلمان-آلمان🔰
🔰مديريت: @tele_emoji🔰
   🌺🌺🌺🌺🌺🌺
☀️توضیح مختصر☀️:
یک ربات ساده و مخصوص مدیریت حرفه ای گروه
   🌺🌺🌺🌺🌺🌺
☀️☀️
تل اسپید یک ربات دوزبانه است
]]
end

return {
  description = "Shows bot version", 
  usage = "ver: Shows bot version",
  patterns = {
    "^تل اسپید$",
    "^ورژن$",
        "^sped$",
            "^version$",
    "^ver$",
        "^Ver$",
      "^Version$",
      "^tele sped$",
    "^تل اسپید$"
  }, 
  run = run 
}

end
